/* eslint-disable no-console */
import { v4 as uuidv4 } from "uuid";

export const ROLE_USER = "user" as const;

export const VSGO_COOKIE = "vsgo_cookie" as const;

export const ROUTE_SIGN_IN = "/sign-in" as const;
export const ROUTE_SIGN_UP = "/sign-up" as const;

export const ROUTE_ROOT = "/" as const;

export const DEFAULT_THEME = "system" as const;

export const THEME_STORAGE_KEY = "vsgo-theme" as const;
export const A11Y_STORAGE_KEY = "vsgo-a11y" as const;
export const FONT_SCALE_STORAGE_KEY = "vsgo-font-scale" as const;

export const ROUTE_MEMBERS = "/members" as const;
export const ROUTE_OFFICES = "/offices" as const;
export const ROUTE_LEGISLATION = "/legislation" as const;
export const ROUTE_ACTIVITIES = "/activities" as const;
export const ROUTE_GALLERY = "/gallery" as const;
export const ROUTE_ADMIN = "/admin" as const;
export const ROUTE_NEWS = "/news" as const;
export const ROUTE_CONTACTS = "/contacts" as const;
export const ROUTE_STATUS = "/status" as const;
export const ROUTE_STRUCTURE = "/structure" as const;
export const ROUTE_MEMBERSHIP = "/membership" as const;
export const ROUTE_RIGHTS = "/rights" as const;
export const ROUTE_TASKS = "/tasks" as const;

export const CACHE_TIME_5_MINUTES = 5 * 60 * 1000;
export const CACHE_TIME_10_MINUTES = 10 * 60 * 1000;

export const getVsgoRoot = (): string => {
  if (typeof window !== "undefined") {
    return "http://localhost:8000";
  }

  const preciseRoot = process.env.API_ROOT;

  if (!preciseRoot || preciseRoot.trim() === "") {
    console.warn(
      "API_ROOT is not set in environment variables, generating a default value"
    );

    return "http://localhost:8000";
  }

  return preciseRoot.trim();
};

export const getSecretKey = (): string => {
  if (typeof window !== "undefined") {
    return uuidv4();
  }

  const secretKey = process.env.SECRET_KEY;

  if (!secretKey || secretKey.trim() === "") {
    console.warn(
      "SECRET_KEY is not set in environment variables, generating a default value"
    );

    return "let t=10;setInterval(_=>console.log(t--),2000)";
  }

  return secretKey.trim();
};

export const UA_REGION_TRANSLATIONS: Record<string, string> = {
  volyn: "Волинська",
  rivne: "Рівненська",
  lviv: "Львівська",
  zakarpattia: "Закарпатська",
  "ivano-frankivsk": "Івано-Франківська",
  ternopil: "Тернопільська",
  chernivtsi: "Чернівецька",
  khmelnytskyi: "Хмельницька",
  zhytomyr: "Житомирська",
  vinnytsia: "Вінницька",
  kyiv: "Київська",
  "kyiv city": "Київ",
  chernihiv: "Чернігівська",
  sumy: "Сумська",
  poltava: "Полтавська",
  cherkasy: "Черкаська",
  kirovohrad: "Кіровоградська",
  dnipropetrovsk: "Дніпропетровська",
  zaporizhia: "Запорізька",
  zaporizhzhia: "Запорізька",
  zaporozhia: "Запорізька",
  zaporozhye: "Запорізька",
  kharkiv: "Харківська",
  luhansk: "Луганська",
  donetsk: "Донецька",
  mykolaiv: "Миколаївська",
  odesa: "Одеська",
  odessa: "Одеська",
  kherson: "Херсонська",
  crimea: "Крим",
  sevastopol: "Севастополь",
};
export const regionalOffices = [
  {
    region: "Київська область",
    name: "ПРЕДСТАВНИЦТВО ВСЕУКРАЇНСЬКОЇ ВСГО «КОНФЕДЕРАЦІЯ ГОІУ» ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ",
    contact:
      "«КОНФЕДЕРАЦІЯ ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ ІНВАЛІДІВ УКРАЇНИ» В М. КИЄВІ",
    address: "вул. Рибальська, 22, м. Київ, 04655",
    phone: "+380(44)253-04-71, +380(44)253-04-82",
  },
  {
    region: "Черкаська область",
    name: "ПРЕДСТАВНИЦТВО ВСЕУКРАЇНСЬКОЇ ВСГО «КОНФЕДЕРАЦІЯ ГОІУ» ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ",
    contact:
      "«КОНФЕДЕРАЦІЯ ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ ІНВАЛІДІВ УКРАЇНИ» В ЧЕРКАСЬКІЙ ОБЛАСТІ",
    address: "вул. Хрещатик, 174, м. Черкаси, Черкаська область, 18010",
    phone: "+380(472)54-14-02",
  },
  {
    region: "Сумська область",
    name: "ПРЕДСТАВНИЦТВО ВСЕУКРАЇНСЬКОЇ ВСГО «КОНФЕДЕРАЦІЯ ГОІУ» ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ",
    contact:
      "«КОНФЕДЕРАЦІЯ ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ ІНВАЛІДІВ УКРАЇНИ» В СУМСЬКІЙ ОБЛАСТІ",
    address: "вул. Покровська, 12, м. Суми, Сумська область, 40000",
    phone: "+380(542) 35-47-89",
  },
  {
    region: "Полтавська область",
    name: "ПРЕДСТАВНИЦТВО ВСЕУКРАЇНСЬКОЇ ВСГО «КОНФЕДЕРАЦІЯ ГОІУ» ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ",
    contact:
      "«КОНФЕДЕРАЦІЯ ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ ІНВАЛІДІВ УКРАЇНИ» В ПОЛТАВСЬКІЙ ОБЛАСТІ",
    address: "вул. Соборності, 57, м. Полтава, Полтавська область, 36039",
    phone: "+380(532) 56-34-21",
  },
  {
    region: "Харківська область",
    name: "ПРЕДСТАВНИЦТВО ВСЕУКРАЇНСЬКОЇ ВСГО «КОНФЕДЕРАЦІЯ ГОІУ» ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ",
    contact:
      "«КОНФЕДЕРАЦІЯ ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ ІНВАЛІДІВ УКРАЇНИ» В ХАРКІВСЬКІЙ ОБЛАСТІ",
    address: "пр. Московський, 2, м. Харків, Харківська область, 61000",
    phone: "+380(572) 49-12-34",
  },
  {
    region: "Донецька область",
    name: "ПРЕДСТАВНИЦТВО ВСЕУКРАЇНСЬКОЇ ВСГО «КОНФЕДЕРАЦІЯ ГОІУ» ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ",
    contact:
      "«КОНФЕДЕРАЦІЯ ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ ІНВАЛІДІВ УКРАЇНИ» З ДОНЕЦЬКОЇ ОБЛАСТІ",
    address: "вул. Артема, 95, м. Слов'янськ, Донецька область, 84116",
    phone: "+380(626) 45-78-90",
  },
  {
    region: "Луганська область",
    name: "ПРЕДСТАВНИЦТВО ВСЕУКРАЇНСЬКОЇ ВСГО «КОНФЕДЕРАЦІЯ ГОІУ» ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ",
    contact:
      "«КОНФЕДЕРАЦІЯ ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ ІНВАЛІДІВ УКРАЇНИ» З ЛУГАНСЬКОЇ ОБЛАСТІ",
    address: "вул. Гагаріна, 34, м. Сєвєродонецьк, Луганська область, 93400",
    phone: "+380(645) 32-11-45",
  },
  {
    region: "Дніпропетровська область",
    name: "ПРЕДСТАВНИЦТВО ВСЕУКРАЇНСЬКОЇ ВСГО «КОНФЕДЕРАЦІЯ ГОІУ» ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ",
    contact:
      "«КОНФЕДЕРАЦІЯ ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ ІНВАЛІДІВ УКРАЇНИ» У ДНІПРОПЕТРОВСЬКІЙ ОБЛАСТІ",
    address: "вул. Космічна, 17, м. Дніпро, Дніпропетровська область, 49000",
    phone: "+380(562) 27-89-56",
  },
  {
    region: "Запорізька область",
    name: "ПРЕДСТАВНИЦТВО ВСЕУКРАЇНСЬКОЇ ВСГО «КОНФЕДЕРАЦІЯ ГОІУ» ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ",
    contact:
      "«КОНФЕДЕРАЦІЯ ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ ІНВАЛІДІВ УКРАЇНИ» В ЗАПОРІЗЬКІЙ ОБЛАСТІ",
    address: "пр. Соборний, 89, м. Запоріжжя, Запорізька область, 69000",
    phone: "+380(612) 64-23-78",
  },
  {
    region: "Херсонська область",
    name: "ПРЕДСТАВНИЦТВО ВСЕУКРАЇНСЬКОЇ ВСГО «КОНФЕДЕРАЦІЯ ГОІУ» ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ",
    contact:
      "«КОНФЕДЕРАЦІЯ ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ ІНВАЛІДІВ УКРАЇНИ» В ХЕРСОНСЬКІЙ ОБЛАСТІ",
    address: "вул. Ушакова, 45, м. Херсон, Херсонська область, 73000",
    phone: "+380(552) 42-67-31",
  },
  {
    region: "Одеська область",
    name: "ПРЕДСТАВНИЦТВО ВСЕУКРАЇНСЬКОЇ ВСГО «КОНФЕДЕРАЦІЯ ГОІУ» ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ",
    contact:
      "«КОНФЕДЕРАЦІЯ ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ ІНВАЛІДІВ УКРАЇНИ» В ОДЕСЬКІЙ ОБЛАСТІ",
    address: "вул. Дерибасівська, 12, м. Одеса, Одеська область, 65000",
    phone: "+380(482) 34-89-12",
  },
  {
    region: "Миколаївська область",
    name: "ПРЕДСТАВНИЦТВО ВСЕУКРАЇНСЬКОЇ ВСГО «КОНФЕДЕРАЦІЯ ГОІУ» ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ",
    contact:
      "«КОНФЕДЕРАЦІЯ ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ ІНВАЛІДІВ УКРАЇНИ» В МИКОЛАЇВСЬКІЙ ОБЛАСТІ",
    address: "пр. Центральний, 28, м. Миколаїв, Миколаївська область, 54000",
    phone: "+380(512) 47-83-56",
  },
  {
    region: "Кіровоградська область",
    name: "ПРЕДСТАВНИЦТВО ВСЕУКРАЇНСЬКОЇ ВСГО «КОНФЕДЕРАЦІЯ ГОІУ» ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ",
    contact:
      "«КОНФЕДЕРАЦІЯ ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ ІНВАЛІДІВ УКРАЇНИ» В КІРОВОГРАДСЬКІЙ ОБЛАСТІ",
    address:
      "вул. Преображенська, 67, м. Кропивницький, Кіровоградська область, 25000",
    phone: "+380(522) 24-78-43",
  },
  {
    region: "Вінницька область",
    name: "ПРЕДСТАВНИЦТВО ВСЕУКРАЇНСЬКОЇ ВСГО «КОНФЕДЕРАЦІЯ ГОІУ» ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ",
    contact:
      "«КОНФЕДЕРАЦІЯ ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ ІНВАЛІДІВ УКРАЇНИ» У ВІННИЦЬКІЙ ОБЛАСТІ",
    address: "вул. Соборна, 34, м. Вінниця, Вінницька область, 21000",
    phone: "+380(432) 65-23-19",
  },
  {
    region: "Хмельницька область",
    name: "ПРЕДСТАВНИЦТВО ВСЕУКРАЇНСЬКОЇ ВСГО «КОНФЕДЕРАЦІЯ ГОІУ» ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ",
    contact:
      "«КОНФЕДЕРАЦІЯ ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ ІНВАЛІДІВ УКРАЇНИ» В ХМЕЛЬНИЦЬКІЙ ОБЛАСТІ",
    address: "пр. Миру, 78, м. Хмельницький, Хмельницька область, 29000",
    phone: "+380(382) 64-31-87",
  },
  {
    region: "Житомирська область",
    name: "ПРЕДСТАВНИЦТВО ВСЕУКРАЇНСЬКОЇ ВСГО «КОНФЕДЕРАЦІЯ ГОІУ» ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ",
    contact:
      "«КОНФЕДЕРАЦІЯ ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ ІНВАЛІДІВ УКРАЇНИ» В ЖИТОМИРСЬКІЙ ОБЛАСТІ",
    address: "вул. Київська, 23, м. Житомир, Житомирська область, 10000",
    phone: "+380(412) 41-67-92",
  },
  {
    region: "Рівненська область",
    name: "ПРЕДСТАВНИЦТВО ВСЕУКРАЇНСЬКОЇ ВСГО «КОНФЕДЕРАЦІЯ ГОІУ» ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ",
    contact:
      "«КОНФЕДЕРАЦІЯ ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ ІНВАЛІДІВ УКРАЇНИ» У РІВНЕНСЬКІЙ ОБЛАСТІ",
    address: "вул. Соборна, 56, м. Рівне, Рівненська область, 33000",
    phone: "+380(362) 26-94-15",
  },
  {
    region: "Волинська область",
    name: "ПРЕДСТАВНИЦТВО ВСЕУКРАЇНСЬКОЇ ВСГО «КОНФЕДЕРАЦІЯ ГОІУ» ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ",
    contact:
      "«КОНФЕДЕРАЦІЯ ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ ІНВАЛІДІВ УКРАЇНИ» У ВОЛИНСЬКІЙ ОБЛАСТІ",
    address: "пр. Волі, 12, м. Луцьк, Волинська область, 43000",
    phone: "+380(332) 74-28-91",
  },
  {
    region: "Львівська область",
    name: "ПРЕДСТАВНИЦТВО ВСЕУКРАЇНСЬКОЇ ВСГО «КОНФЕДЕРАЦІЯ ГОІУ» ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ",
    contact:
      "«КОНФЕДЕРАЦІЯ ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ ІНВАЛІДІВ УКРАЇНИ» У ЛЬВІВСЬКІЙ ОБЛАСТІ",
    address: "вул. Городоцька, 89, м. Львів, Львівська область, 79000",
    phone: "+380(322) 97-43-68",
  },
  {
    region: "Тернопільська область",
    name: "ПРЕДСТАВНИЦТВО ВСЕУКРАЇНСЬКОЇ ВСГО «КОНФЕДЕРАЦІЯ ГОІУ» ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ",
    contact:
      "«КОНФЕДЕРАЦІЯ ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ ІНВАЛІДІВ УКРАЇНИ» В ТЕРНОПІЛЬСЬКІЙ ОБЛАСТІ",
    address: "вул. Руська, 45, м. Тернопіль, Тернопільська область, 46000",
    phone: "+380(352) 43-67-82",
  },
  {
    region: "Івано-Франківська область",
    name: "ПРЕДСТАВНИЦТВО ВСЕУКРАЇНСЬКОЇ ВСГО «КОНФЕДЕРАЦІЯ ГОІУ» ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ",
    contact:
      "«КОНФЕДЕРАЦІЯ ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ ІНВАЛІДІВ УКРАЇНИ» В ІВАНО-ФРАНКІВСЬКІЙ ОБЛАСТІ",
    address:
      "вул. Незалежності, 34, м. Івано-Франківськ, Івано-Франківська область, 76000",
    phone: "+380(342) 55-89-23",
  },
  {
    region: "Чернівецька область",
    name: "ПРЕДСТАВНИЦТВО ВСЕУКРАЇНСЬКОЇ ВСГО «КОНФЕДЕРАЦІЯ ГОІУ» ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ",
    contact:
      "«КОНФЕДЕРАЦІЯ ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ ІНВАЛІДІВ УКРАЇНИ» В ЧЕРНІВЕЦЬКІЙ ОБЛАСТІ",
    address: "вул. Головна, 67, м. Чернівці, Чернівецька область, 58000",
    phone: "+380(372) 58-46-39",
  },
  {
    region: "Закарпатська область",
    name: "ПРЕДСТАВНИЦТВО ВСЕУКРАЇНСЬКОЇ ВСГО «КОНФЕДЕРАЦІЯ ГОІУ» ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ",
    contact:
      "«КОНФЕДЕРАЦІЯ ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ ІНВАЛІДІВ УКРАЇНИ» В ЗАКАРПАТСЬКІЙ ОБЛАСТІ",
    address: "пр. Свободи, 23, м. Ужгород, Закарпатська область, 88000",
    phone: "+380(312) 61-47-85",
  },
  {
    region: "Чернігівська область",
    name: "ПРЕДСТАВНИЦТВО ВСЕУКРАЇНСЬКОЇ ВСГО «КОНФЕДЕРАЦІЯ ГОІУ» ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ",
    contact:
      "«КОНФЕДЕРАЦІЯ ГРОМАДСЬКИХ ОРГАНІЗАЦІЙ ІНВАЛІДІВ УКРАЇНИ» В ЧЕРНІГІВСЬКІЙ ОБЛАСТІ",
    address: "вул. Мира, 34, м. Чернігів, Чернігівська область, 14000",
    phone: "+380(462) 67-39-28",
  },
];
